share/tutorials/incompressible/pimple/tjunction/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 200;

boundaryField
{
  inlet
  {
    type            turbulentMixingLengthDissipationRateInlet;
    mixingLength    0.01;       // 1cm - half channel height
    value           $internalField;
  }
  outlet1
  {
    type            inletOutlet;
    inletValue      $internalField;
  }
  outlet2
  {
    type            inletOutlet;
    inletValue      $internalField;
  }
  defaultFaces
  {
    type            epsilonWallFunction;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
