share/tutorials/incompressible/pimple/tjunction/0/nuTilda
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet1
  {
    type            zeroGradient;
  }
  outlet2
  {
    type            zeroGradient;
  }
  defaultFaces
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
